app/views/songs/index.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 1]]
---
  <%= link_to "Create New song", new_artist_song_path(@artist) %>
  <% @artist.songs.each do |song| %>