app/views/songs/show.html.erb

<hr />
<% @billboard = Billboard.find_by_id(params[:billboard_id]) %>
---
SELECT "billboards".* FROM "billboards" WHERE "billboards"."id" IS NULL LIMIT $1  [["LIMIT", 1]]