app/views/boards/show.html.erb


<% @board.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."board_id" = $1  [["board_id", 1]]