app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)
    if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2020-02-23 19:16:26.501575"], ["updated_at", "2020-02-23 19:16:26.501575"]]

  def destroy
    @artist.destroy
---
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 2]]

  def set_artist
    @artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]