app/controllers/billboards_controller.rb

SELECT "billboards".* FROM "billboards"
---
  def index
    @billboards = Billboard.all

SELECT "billboards".* FROM "billboards" WHERE "billboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."billboard_id" IS NULL
---
  def new_song
    @billboard = Billboard.find(params[:id])
    @songs = Song.all.where(billboard_id: nil)

SELECT "billboards".* FROM "billboards" WHERE "billboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "billboards" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Testing"], ["created_at", "2020-02-23 18:53:08.302638"], ["updated_at", "2020-02-23 18:53:08.302638"]]
SELECT "songs".* FROM "songs" WHERE "songs"."billboard_id" = $1 AND "songs"."id" = $2 LIMIT $3  [["billboard_id", 1], ["id", nil], ["LIMIT", 1]]
---
  def add_song
    @billboard = Billboard.find(params[:id])
    @billboard.songs << Song.find(params[:song_id])

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "songs" SET "billboard_id" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["billboard_id", nil], ["updated_at", "2020-02-24 02:01:12.141489"], ["id", 4]]
---
  def remove_song
    #before_action
    Song.find(params[:song_id]).update(billboard_id: nil)

INSERT INTO "billboards" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Testing"], ["created_at", "2020-02-23 18:53:08.302638"], ["updated_at", "2020-02-23 18:53:08.302638"]]
---
  def create
    @billboard = Billboard.new(billboard_params)

    if @billboard.save

DELETE FROM "billboards" WHERE "billboards"."id" = $1  [["id", 1]]
---
  def destroy
    #before_action
    @billboard.destroy

SELECT "billboards".* FROM "billboards" WHERE "billboards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_billboard
    @billboard = Billboard.find(params[:id])