app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards"
---
  def index
    @boards = Board.all

INSERT INTO "boards" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Blah blah"], ["created_at", "2020-02-23 05:39:22.516237"], ["updated_at", "2020-02-23 05:39:22.516237"]]
---
  def create
    @board = Board.new(board_params)

    if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_board
    @board = Board.find(params[:id])