app/controllers/songs_controller.rb

  def create
    @song = @artist.songs.new(song_params)
    if @song.save
---
INSERT INTO "songs" ("name", "artist_id", "billboard_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sdfasdfasdf"], ["artist_id", 3], ["billboard_id", 2], ["created_at", "2020-02-24 01:45:06.044097"], ["updated_at", "2020-02-24 01:45:06.044097"]]

  def update
    if @artist.songs.update(song_params)
---
UPDATE "songs" SET "name" = $1, "billboard_id" = $2, "updated_at" = $3 WHERE "songs"."id" = $4  [["name", "Friend of the Devil"], ["billboard_id", 1], ["updated_at", "2020-02-24 02:27:09.723379"], ["id", 2]]

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 41]]

  def set_artist
    @artist = Artist.find(params[:artist_id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]