app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 1]]
---
  def index
    #before_action
    @songs = @artist.songs.all